Outline
* Drop Entry
* Selecting Entries

In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

# Drop Entry
`drop()` return的都是新的instance，要真正修改原instance需要`a = a.drop(...)`

In [2]:
ser1 = Series(np.arange(3), index=['a', 'b', 'c'])
ser1

a    0
b    1
c    2
dtype: int64

In [3]:
# Drop series
ser1.drop('b')

a    0
c    2
dtype: int64

In [6]:
dframe1 = DataFrame(np.arange(9).reshape([3, 3]), index=['SF', 'LA', 'NY'], columns=['pop', 'size', 'year'])
dframe

    pop  size  year
SF    0     1     2
LA    3     4     5
NY    6     7     8

In [12]:
# drop Dataframe's index
dframe1.drop('LA')

    pop  size  year
SF    0     1     2
NY    6     7     8

In [13]:
# drop Dataframe's column
dframe1.drop('year', axis=1)

    pop  size
SF    0     1
LA    3     4
NY    6     7

# Selecting Entries

### Series

In [18]:
ser1 = Series(np.arange(3)*2, index=['a', 'b', 'c'])
ser1

a    0
b    2
c    4
dtype: int64

In [21]:
# string index
ser1['b']

2

In [22]:
# number index
ser1[1]

2

In [23]:
ser1[0:3]

a    0
b    2
c    4
dtype: int64

In [29]:
ser1[['a', 'b', 'other']]

a        0.0
b        2.0
other    NaN
dtype: float64

In [30]:
ser1[ser1 > 3]

c    4
dtype: int64

In [31]:
# assignment
ser1[ser1 > 3] = 10
ser1

a     0
b     2
c    10
dtype: int64

### Dataframe

In [32]:
dframe = DataFrame(np.arange(25).reshape((5,5)),
                   index=['NYC', 'LA', 'SF', 'DC', 'Chi'],
                   columns=['A', 'B', 'C', 'D', 'E'])
dframe

      A   B   C   D   E
NYC   0   1   2   3   4
LA    5   6   7   8   9
SF   10  11  12  13  14
DC   15  16  17  18  19
Chi  20  21  22  23  24

In [37]:
dframe['B']

NYC     1
LA      6
SF     11
DC     16
Chi    21
Name: B, dtype: int64

In [40]:
dframe[['B', 'E']]

      B   E
NYC   1   4
LA    6   9
SF   11  14
DC   16  19
Chi  21  24

In [41]:
dframe[dframe['C'] > 8]

      A   B   C   D   E
SF   10  11  12  13  14
DC   15  16  17  18  19
Chi  20  21  22  23  24

In [42]:
dframe > 10

         A      B      C      D      E
NYC  False  False  False  False  False
LA   False  False  False  False  False
SF   False   True   True   True   True
DC    True   True   True   True   True
Chi   True   True   True   True   True

In [43]:
# string index
dframe.ix['LA']

A    5
B    6
C    7
D    8
E    9
Name: LA, dtype: int64

In [44]:
# number index
dframe.ix[1]

A    5
B    6
C    7
D    8
E    9
Name: LA, dtype: int64

In [48]:
dframe.ix[['LA', 'TW'], ['B', 'C', 'F']]

      B    C   F
LA  6.0  7.0 NaN
TW  NaN  NaN NaN